perf/bbox1.yaml
config:
  environments:
    serv-0:
      target: 'http://localhost:9090/1c20-tp1_bbox_1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox0"
    serv-1:
      target: 'http://localhost:9091/1c20-tp1_bbox_1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox1"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Clear start"
      pause: 30
    - name: "*** 2 rps ***"
      duration: 30
      arrivalRate: 2
    - name: "*** 3 rps ***"
      duration: 30
      arrivalRate: 3
    - name: "*** 4 rps ***"
      duration: 30
      arrivalRate: 4
    - name: "*** 5 rps ***"
      duration: 30
      arrivalRate: 5
    - name: "*** 6 rps ***"
      duration: 30
      arrivalRate: 6
    - name: "*** 7 rps ***"
      duration: 30
      arrivalRate: 7
    - name: "*** 8 rps ***"
      duration: 30
      arrivalRate: 8
    - name: "*** 9 rps ***"
      duration: 30
      arrivalRate: 9
    - name: "*** 10 rps ***"
      duration: 30
      arrivalRate: 10
    - name: "*** 11 rps ***"
      duration: 30
      arrivalRate: 11
    - name: "*** 12 rps ***"
      duration: 30
      arrivalRate: 12
    - name: "*** 13 rps ***"
      duration: 30
      arrivalRate: 13
    - name: "*** 14 rps ***"
      duration: 30
      arrivalRate: 14
    - name: "*** 15 rps ***"
      duration: 30
      arrivalRate: 15
    - name: "*** 16 rps ***"
      duration: 30
      arrivalRate: 16
    - name: "*** 17 rps ***"
      duration: 30
      arrivalRate: 17
    - name: "*** 18 rps ***"
      duration: 30
      arrivalRate: 18
    - name: "*** 19 rps ***"
      duration: 30
      arrivalRate: 19
    - name: "*** 20 rps ***"
      duration: 30
      arrivalRate: 20


    - name: "Clear end"
      pause: 30

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'