perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Warm up the application"
      duration: 30
      arrivalRate: 1
      rampTo: 3
    - name: "Sustained max load"
      duration: 30
      arrivalRate: 3
    - name: "Start overloading"
      duration: 30
      arrivalRate: 3
      rampTo: 4
    - name: "Sustained overloading"
      duration: 30
      arrivalRate: 4
    - name: "Clear"
      pause: 30
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'