perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Clear start"
      pause: 30
    - name: "11 rps"
      duration: 30
      arrivalRate: 11
    - name: "12 rps"
      duration: 30
      arrivalRate: 12
    - name: "13 rps"
      duration: 30
      arrivalRate: 13
    - name: "Clear end"
      pause: 30    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'